index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Tim McIver)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h2>Domain-Driven Design</h2><h2 class="author">Tim McIver</h2> 
</section>

<section>
<section id="slide-org8f09c0c">
<h2 id="org8f09c0c">DDD: What Is It?</h2>
<div class="outline-text-2" id="text-org8f09c0c">
</div></section>
<section id="slide-org76b9e3e">
<h3 id="org76b9e3e">Domain-Driven Design</h3>
<ul>
<li class="fragment appear">Emphasizes the domain model as the central piece of an application</li>
<li class="fragment appear">Emphasizes direct collaboration between developers and domain experts</li>
<li class="fragment appear">Results in a "Ubiquitous Language" that is used to communicate domain concepts</li>

</ul>

</section>
</section>
<section>
<section id="slide-orga3a776d">
<h2 id="orga3a776d">Building Blocks</h2>
<div class="outline-text-2" id="text-orga3a776d">
</div></section>
<section id="slide-orgb6452aa">
<h3 id="orgb6452aa">4 Basic Types</h3>
<ul>
<li>Entities</li>
<li>Value Objects</li>
<li>Repositories</li>
<li>Services</li>

</ul>

</section>
<section id="slide-orge772ebb">
<h3 id="orge772ebb">Entities</h3>
<p>
are domain objects whose identity is NOT defined by their attributes
</p>
<ul>
<li class="fragment appear">Consider two people with the same name; they are not the same entity!</li>
<li class="fragment appear">Some entities will have natural identifiers. E.g., SSN.</li>
<li class="fragment appear">If there is no natural identifier, one must be generated for it at creation time.</li>

</ul>

</section>
<section id="slide-org8d8b4de">
<h3 id="org8d8b4de">Value Objects</h3>
<p>
are objects that ARE defined by their attributes
</p>
<ul>
<li class="fragment appear">Need no separate identifier</li>
<li class="fragment appear">Should be immutable</li>

</ul>

</section>
<section id="slide-org874b22c">
<h3 id="org874b22c">Some Notes About References</h3>
<ul>
<li class="fragment appear">An Entity should reference other Entities by their identifiers - not through direct references.</li>
<li class="fragment appear">A reference to an Entity should be retrieved by using a Repository.</li>
<li class="fragment appear">References to Value Objects must be by direct reference since they have no identifier.</li>

</ul>

</section>
<section id="slide-orgf7a9909">
<h3 id="orgf7a9909">Example</h3>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #73d216;">// </span><span style="color: #73d216;">Entity</span>
<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">User</span> {
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">id</span>; <span style="color: #73d216;">// </span><span style="color: #73d216;">could have used SSN, if it was available</span>
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">name</span>;
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">address</span>;

  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">changeName</span>($<span style="color: #fcaf3e;">newName</span>) { $<span style="color: #e9b2e3;">this</span>-&gt;<span style="color: #fcaf3e;">name</span> = $<span style="color: #fcaf3e;">newName</span>; }
  <span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">changeAddress</span>($<span style="color: #fcaf3e;">newAddress</span>) { $<span style="color: #e9b2e3;">this</span>-&gt;<span style="color: #fcaf3e;">address</span> = $<span style="color: #fcaf3e;">newAddress</span>; }
}

<span style="color: #73d216;">// </span><span style="color: #73d216;">Value Object</span>
<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Name</span> {
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">firstName</span>;
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">lastName</span>;
}

<span style="color: #73d216;">// </span><span style="color: #73d216;">Value Object</span>
<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">Address</span> {
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">street</span>;
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">city</span>;
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">state</span>;
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">zip</span>
}
</pre>
</div>

</section>
<section id="slide-orgfcd5e59">
<h3 id="orgfcd5e59">Repositories</h3>
<ul>
<li class="fragment appear">are objects used to retrieve entities from and persist entities to storage.</li>
<li class="fragment appear">Recommend creating an interface or trait so that different implementatinos can be provided (this is the Strategy Pattern: <a href="https://en.wikipedia.org/wiki/Strategy_pattern">https://en.wikipedia.org/wiki/Strategy_pattern</a>)</li>

</ul>

</section>
<section id="slide-org9f98240">
<h3 id="org9f98240">Example Repository</h3>
<div class="org-src-container">

<pre  class="src src-php"><span style="color: #b4fa70;">interface</span> <span style="color: #8cc4ff;">Repository</span> {
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">getById</span>($<span style="color: #fcaf3e;">id</span>);
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">save</span>($<span style="color: #fcaf3e;">entity</span>);
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">MySqlRepository</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Repository</span> {

  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">getById</span>($<span style="color: #fcaf3e;">id</span>) { <span style="color: #73d216;">/* </span><span style="color: #73d216;">query real MySQL database </span><span style="color: #73d216;">*/</span> }
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">save</span>($<span style="color: #fcaf3e;">entity</span>) { <span style="color: #73d216;">/* </span><span style="color: #73d216;">insert data into real MySQL database </span><span style="color: #73d216;">*/</span> }
}

<span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">InMemoryRepository</span> <span style="color: #b4fa70;">implements</span> <span style="color: #8cc4ff;">Repository</span> {
  <span style="color: #b4fa70;">private</span> $<span style="color: #fcaf3e;">db</span>; <span style="color: #73d216;">// </span><span style="color: #73d216;">array of id to entity</span>

  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">getById</span>($<span style="color: #fcaf3e;">id</span>) { <span style="color: #73d216;">/* </span><span style="color: #73d216;">query $db </span><span style="color: #73d216;">*/</span> }
  <span style="color: #b4fa70;">function</span> <span style="color: #fce94f;">save</span>($<span style="color: #fcaf3e;">entity</span>) { <span style="color: #73d216;">/* </span><span style="color: #73d216;">mutate $db </span><span style="color: #73d216;">*/</span> }
}
</pre>
</div>

</section>
<section id="slide-org70f8a61">
<h3 id="org70f8a61">Services</h3>
<p>
are objects that
</p>
<ul>
<li class="fragment appear">orchestrate coordination of complex domain logic</li>
<li class="fragment appear">ideally will allow clients to perform this complex action with a single method call</li>

</ul>

</section>
<section id="slide-org2cd6842">
<h3 id="org2cd6842">Example Service</h3>
<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">OpenEnrollment</span>(oeRepo<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Repository</span>[<span style="color: #e9b2e3;">OpenEnrollment</span>],
                     titanClient<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">TitanClient</span>) {
  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">edit</span>(oeId<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">UUID</span>, startDate<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Instant</span>, endDate<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Instant</span>)<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Future</span>[<span style="color: #e9b2e3;">Unit</span>] <span style="color: #b4fa70;">=</span> {
    <span style="color: #b4fa70;">for</span> { <span style="color: #73d216;">// </span><span style="color: #73d216;">In Future</span>
      <span style="color: #73d216;">// </span><span style="color: #73d216;">get the OE domain object</span>
      oe <span style="color: #b4fa70;">&lt;-</span> oeRepo.getById(oeID)

      <span style="color: #73d216;">// </span><span style="color: #73d216;">edit the OE</span>
      editedOe <span style="color: #b4fa70;">&lt;-</span> editOpenEnrollent(oe)

      <span style="color: #73d216;">// </span><span style="color: #73d216;">save it</span>
      <span style="color: #b4fa70;">_</span> <span style="color: #b4fa70;">&lt;-</span> oeRepo.save(editedOe)

      <span style="color: #73d216;">// </span><span style="color: #73d216;">conditionally "run" it</span>
      <span style="color: #b4fa70;">_</span> <span style="color: #b4fa70;">&lt;-</span> <span style="color: #b4fa70;">if</span> (editedOe.status === <span style="color: #e9b2e3;">OpenEnrollmentState</span>.<span style="color: #e9b2e3;">Ready</span>)
             runOpenEnrollment(editedOe)
           <span style="color: #b4fa70;">else</span>
             <span style="color: #e9b2e3;">Future</span>.successful(())
    }
  }

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">runOpenEnrollment</span>(oe<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">OpenEnrollment</span>)<span style="color: #b4fa70;">:</span> <span style="color: #8cc4ff;">Future</span>[<span style="color: #e9b2e3;">Unit</span>] <span style="color: #b4fa70;">=</span> { ... }
}
</pre>
</div>

</section>
<section id="slide-orgd6815a6">
<h3 id="orgd6815a6">Bounded Contexts</h3>
<ul>
<li class="fragment appear">Could be defined as "a boundary within which a given model applies".</li>
<li class="fragment appear">Similarly named models in different bounded contexts could be very different
<ul>
<li>One could be an Entity while the other a Value Object.</li>

</ul></li>
<li class="fragment appear">Typically a bounded context is implemented as its own microservice.</li>

</ul>

</section>
<section id="slide-org93ab269">
<h3 id="org93ab269">References</h3>
<ul>
<li>"Domain-Driven Design Distilled" by Vaughn Vernon <a href="https://www.safaribooksonline.com/library/view/domain-driven-design-distilled/9780134434964/">https://www.safaribooksonline.com/library/view/domain-driven-design-distilled/9780134434964/</a></li>
<li>"Patterns, Principles, and Practices of Domain-Driven Design" by Nick Tune, Scott Millett <a href="https://www.safaribooksonline.com/library/view/patterns-principles-and/9781118714706/">https://www.safaribooksonline.com/library/view/patterns-principles-and/9781118714706/</a></li>

</ul>

</section>
<section id="slide-org0f7dde3">
<h3 id="org0f7dde3">Questions?</h3>
</section>
</section>
</div>
</div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: './reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
